In [26]:
import pandas as pd
india = pd.DataFrame({
    "city":['mumbai','delhi','banglore'],
    "temp":[45,34,38],
    "humidity":[60,70,45]
},index=[0,1,2])
india

       city  temp  humidity
0    mumbai    45        60
1     delhi    34        70
2  banglore    38        45

In [27]:
us = pd.DataFrame({
    "city":['delhi','banglore','mumbai'],
    "temp":[30,35,29],
    "humidity":[50,45,56]
},index=[1,2,0])
us

       city  temp  humidity
1     delhi    30        50
2  banglore    35        45
0    mumbai    29        56

In [28]:
concatdf = pd.concat([india,us],keys=['india','us'])
concatdf

             city  temp  humidity
india 0    mumbai    45        60
      1     delhi    34        70
      2  banglore    38        45
us    1     delhi    30        50
      2  banglore    35        45
      0    mumbai    29        56

In [29]:
concatdf.loc['india']

       city  temp  humidity
0    mumbai    45        60
1     delhi    34        70
2  banglore    38        45

In [30]:
column = pd.concat([india,us],axis=1) #appending dataframes columnwise

In [31]:
column

       city  temp  humidity      city  temp  humidity
0    mumbai    45        60    mumbai    29        56
1     delhi    34        70     delhi    30        50
2  banglore    38        45  banglore    35        45

In [33]:
s = pd.Series(['humid','dry','rain'],name='event')#defining series
s

0    humid
1      dry
2     rain
Name: event, dtype: object

In [35]:
df = pd.concat([column,s],axis=1)#concating series

In [36]:
df

       city  temp  humidity      city  temp  humidity  event
0    mumbai    45        60    mumbai    29        56  humid
1     delhi    34        70     delhi    30        50    dry
2  banglore    38        45  banglore    35        45   rain